"""
Задание №4
📌 Создайте модуль с функцией внутри.
📌 Функция получает на вход загадку, список с возможными вариантами отгадок (все правильные)
и количество попыток на угадывание.
📌 Программа возвращает номер попытки, с которой была отгадана загадка или ноль, если попытки исчерпаны.
"""


def func_1(qws, ans, count):
    i = 0
    print(qws)
    while i < count:
        u_ans = input('Введите ответ: ')
        if u_ans.lower() in ans:
            return i + 1
        else:
            print('Не угадали')
            i += 1
        if i == count:
            return 0


if __name__ == '__main__':
    print(func_1("Не лает, не кусает, в дом не пускает", ['замок', 'охранник', 'собака'], 3))
