"""
Задание №6
📌 Добавьте в модуль с загадками функцию, которая принимает на вход строку (текст загадки) и число (номер
попытки, с которой она угадана).
📌 Функция формирует словарь с информацией о результатах отгадывания.
📌 Для хранения используйте защищённый словарь уровня модуля.
📌 Отдельно напишите функцию, которая выводит результаты
угадывания из защищённого словаря в удобном для чтения виде.
📌 Для формирования результатов используйте генераторное выражение.
"""

dct = {"В чем сила: ": ['в правде', 'в деньгах', 'в силе'],
       "Не лает, не кусает, в дом не пускает": ['замок', 'охранник', 'собака']}

_dict = {}  # защищенный словарь


# def some_func(qw, count):
#     print(qw)
#     answer = ['в правде', 'в деньгах', 'в силе']
#     tries = 0
#     while tries < count:
#         variant = input('Введите ответ: ')
#         if variant in answer:
#             _dict['Вы угадали'] = tries + 1
#             return
#         else:
#             _dict['Вы не угадали'] = tries + 1
#             tries += 1


def some_func(qw, count):  # используем в 5 ой
    _dict[qw] = count


def puzzle_print():
    for k, v in _dict.items():  # используем в 5 ой
        print(f'Загадку: {k}' + (f'угадали с попытки {v}' if v else ' не угадали'))
